# This code is to for connecting to MySQL in Python using the MySQLdb connector.

# Import all relevant libraries and packages.

In [1]:
import MySQLdb
import pandas as pd
import scipy as sp
import matplotlib as mtpl

# Connect to MySQL from Python

In [2]:
conn = MySQLdb.connect(host="ubuntu", user="root", passwd="Pussinboot5", db="studentinfo")

cursor = conn.cursor()

# Run a MySQL Query  using cursor.execute()

In [3]:
cursor.execute('SELECT *  FROM student');

In [4]:
# To fetch all results, use cursor.fetchall()

In [5]:
rows = cursor.fetchall()

In [6]:
# To fetch results, one at a time, use cursor.fetchone()

In [7]:
singlerow = cursor.fetchone()

# This result shows as a tuple of tuples.

# But it'll be better to have it as a Pandas DataFrame. So...

In [8]:
df = pd.DataFrame( [[ij for ij in i] for i in rows] )

In [9]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10
0,Wedam,Nyaaba,wtnt9@mst.edu,1703 N. Elm St,Rolla,MO,65401,M,2016-08-11 09:37:35,4.5,12449235
1,Godfred,Gyimah,gsyt7@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,M,2016-08-11 09:20:55,3.5,12449868
2,Maameyaa,Gyimah,mkayc4@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,F,2016-08-11 07:40:19,2.5,12508338

# Let's try a larger query

In [10]:
cursor.execute('SELECT *  FROM test, score,student WHERE test.test_id=score.test_id AND score.student_id = student.student_id');
rows = cursor.fetchall()
df = pd.DataFrame( [[ij for ij in i] for i in rows] )
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,2016-08-02,Q,15,1,1,12449235,1,94,Wedam,Nyaaba,wtnt9@mst.edu,1703 N. Elm St,Rolla,MO,65401,M,2016-08-11 09:37:35,4.5,12449235
1,2016-08-02,Q,15,1,1,12449868,1,95,Godfred,Gyimah,gsyt7@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,M,2016-08-11 09:20:55,3.5,12449868
2,2016-08-03,Q,15,1,2,12449868,2,92,Godfred,Gyimah,gsyt7@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,M,2016-08-11 09:20:55,3.5,12449868
3,2016-08-03,Q,15,1,2,12508338,2,95,Maameyaa,Gyimah,mkayc4@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,F,2016-08-11 07:40:19,2.5,12508338
4,2016-08-04,T,30,1,3,12449235,3,98,Wedam,Nyaaba,wtnt9@mst.edu,1703 N. Elm St,Rolla,MO,65401,M,2016-08-11 09:37:35,4.5,12449235

# Now let's use the actual column names instead of numbers

In [11]:
cursor.execute('SELECT *  FROM test, score,student WHERE test.test_id=score.test_id AND score.student_id = student.student_id');
rows = cursor.fetchall()
df = pd.DataFrame( [[ij for ij in i] for i in rows] )
df.rename(columns={0: 'Date', 1: 'Exam Type', 2: 'Highest Score', 3: 'Class ID', 4:'Exam ID', 5: 'Student ID', 6: 'Exam ID', 7: 'Score', 8: 'First Name', 9:'Last Name', 10: 'Email', 11: 'Address', 12: 'City', 13: 'State', 14:'Zip', 15: 'Gender', 16: 'Date Entered', 17: 'Lunch Cost', 18: 'Student ID'}, inplace=True);
df.head()

,Date,Exam Type,Highest Score,Class ID,Exam ID,Student ID,Exam ID,Score,First Name,Last Name,Email,Address,City,State,Zip,Gender,Date Entered,Lunch Cost,Student ID
0,2016-08-02,Q,15,1,1,12449235,1,94,Wedam,Nyaaba,wtnt9@mst.edu,1703 N. Elm St,Rolla,MO,65401,M,2016-08-11 09:37:35,4.5,12449235
1,2016-08-02,Q,15,1,1,12449868,1,95,Godfred,Gyimah,gsyt7@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,M,2016-08-11 09:20:55,3.5,12449868
2,2016-08-03,Q,15,1,2,12449868,2,92,Godfred,Gyimah,gsyt7@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,M,2016-08-11 09:20:55,3.5,12449868
3,2016-08-03,Q,15,1,2,12508338,2,95,Maameyaa,Gyimah,mkayc4@mst.edu,"2017 Forum Dr, Apt G",Rolla,MO,65401,F,2016-08-11 07:40:19,2.5,12508338
4,2016-08-04,T,30,1,3,12449235,3,98,Wedam,Nyaaba,wtnt9@mst.edu,1703 N. Elm St,Rolla,MO,65401,M,2016-08-11 09:37:35,4.5,12449235